# -*- coding: utf-8 -*-
# Author: Vladimir Pichugin <vladimir@pichug.in>

from handler.base_plugin import CommandPlugin
from utils import get_role_name, get_username, parse_user_id, get_user_sex

import datetime, time, json

class ContentRolePlayingGamesPlugin(CommandPlugin):
    def __init__(self, prefixes=None, strict=False, required_role=None, ):
        self.description = ["Ролевые игры"]
        self.actions = {
            'ущипнуть': {
                  'male': '&#128558; {0} ущипнул {1}',
                  'female': '&#128558; {0} ущипнула {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'погладить': {
                  'male': '&#128075; {0} погладил {1}',
                  'female': '&#128075; {0} погладила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'избить': {
                  'male': '&#128074; {0} избил {1}',
                  'female': '&#128074; {0} избила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'ударить': {
                  'male': '&#128074; {0} ударил {1}',
                  'female': '&#128074; {0} ударил {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'сильно ударить': {
                  'male': '&#129308;&#128555; {0} сильно ударил {1}',
                  'female': '&#129308;&#128555; {0} сильно ударил {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'ударить сильно': {
                  'male': '&#129308;&#128555; {0} сильно ударил {1}',
                  'female': '&#129308;&#128555; {0} сильно ударил {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'оседлать': {
                  'male': '&#127943; {0} оседлал верхом {1}',
                  'female': '&#127943; {0} оседлала верхом {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'взять': {
                  'male': '&#128080;&#128588; {0} взял {1}',
                  'female': '&#128080;&#128588; {0} взял {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'дать денег': {
                  'male': '&#128176; {0} дал денег {1}',
                  'female': '&#128176; {0} дала денег {1}',
                  'case': 'dat'
            }, # дательный (dat)
            'отдаться': {
                  'male': '&#127825;&#129330; {0} отдался {1}',
                  'female': '&#127825;&#129330; {0} отдалась {1}',
                  'case': 'dat'
            }, # дательный (dat)
            'кусь': {
                  'male': '&#128572; {0} кусьнул {1}',
                  'female': '&#128572; {0} кусьнула {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'куснуть': {
                  'male': '&#128572; {0} кусьнул {1}',
                  'female': '&#128572; {0} кусьнула {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'укусить': {
                  'male': '&#128572; {0} укусил {1}',
                  'female': '&#128572; {0} укусила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'кастрировать': {
                  'male': '&#9986; {0} кастрировал {1}',
                  'female': '&#9986; {0} кастрировала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'лизнуть': {
                  'male': '&#128069; {0} лизнул {1}',
                  'female': '&#128069; {0} лизнула {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'лизь': {
                  'male': '&#128069; {0} лизнул {1}',
                  'female': '&#128069; {0} лизнула {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'лизб': {
                  'male': '&#128069; {0} лизнул {1}',
                  'female': '&#128069; {0} лизнула {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'полизать': {
                  'male': '&#128069; {0} полизал {1}',
                  'female': '&#128069; {0} полизала {1}',
                  'case': 'dat'
            }, # дательный (dat)
            'облизать': {
                  'male': '&#128069; {0} облизал {1}',
                  'female': '&#128069; {0} облизала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'облизнуть': {
                  'male': '&#128069; {0} облизнул {1}',
                  'female': '&#128069; {0} облизнула {1}',
                  'case': 'acc'            
            }, # винительный (acc)
            'обнять': {
                  'male': '&#129303; {0} обнял {1}',
                  'female': '&#129303; {0} обняла {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'отравить': {
                  'male': '&#128138; {0} отравил {1}',
                  'female': '&#128138; {0} отравила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'убить': {
                  'male': '&#128298;&#128165; {0} убил {1}',
                  'female': '&#128298;&#128165; {0} убила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'поздравить': {
                  'male': '&#129395; {0} поздравил {1}',
                  'female': '&#129395; {0} поздравила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'поцеловать': {
                  'male': '&#128538; {0} поцеловал {1}',
                  'female': '&#128538; {0} поцеловала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'прижать': {
                  'male': '&#129330; {0} прижал {1}',
                  'female': '&#129330; {0} прижала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'похвалить': {
                  'male': '&#128077; {0} похвалил {1}',
                  'female': '&#128077; {0} похвалила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'пнуть': {
                  'male': '&#128094; {0} пнул {1}',
                  'female': '&#128094; {0} пнула {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'покормить': {
                  'male': '&#128523; {0} покормил {1}',
                  'female': '&#128523; {0} покормила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'накормить': {
                  'male': '&#128523; {0} накормил {1}',
                  'female': '&#128523; {0} накормила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'расстрелять': {
                  'male': '&#128165;&#128299; {0} расстрелял {1}',
                  'female': '&#128165;&#128299; {0} расстреляла {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'застрелить': {
                  'male': '&#128165;&#128299; {0} застрелил {1}',
                  'female': '&#128165;&#128299; {0} застрелила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'сжечь': {
                  'male': '&#128293; {0} сжёг {1}',
                  'female': '&#128293; {0} сожгла {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'шлепнуть': {
                  'male': '&#128079; {0} шлёпнул {1}',
                  'female': '&#128079; {0} шлёпнула {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'пригласить на чаёк': {
                  'male': '&#9749; {0} пригласил на чаёк &#127856; {1}',
                  'female': '&#9749; {0} пригласила на чаёк &#127856; {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'выпить чаю': {
                  'male': '&#9749; {0} пригласил на чаёк &#127856; {1}',
                  'female': '&#9749; {0} пригласила на чаёк &#127856; {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'обоссать': {
                  'male': '&#128166;&#128166; {0} обоссал {1}',
                  'female': '&#128166;&#128166; {0} обоссала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'прогнать': {
                  'male': '&#128073; {0} прогнал {1}',
                  'female': '&#128073; {0} прогнала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'выбросить': {
                  'male': '&#9851; {0} выбросил {1}',
                  'female': '&#9851; {0} выбросила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'ням': {
                  'male': '&#128523; {0} съел {1}',
                  'female': '&#128523; {0} съела {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'съесть': {
                  'male': '&#128523; {0} съел {1}',
                  'female': '&#128523; {0} съела {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'сфотографировать': {
                  'male': '&#128247; {0} сфотографировал {1}',
                  'female': '&#128247; {0} сфотографировала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'сфоткать': {
                  'male': '&#128247; {0} сфотографировал {1}',
                  'female': '&#128247; {0} сфотографировала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'фотография': {
                  'male': '&#128247; {0} сфотографировал {1}',
                  'female': '&#128247; {0} сфотографировала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'фото': {
                  'male': '&#128247; {0} сфотографировал {1}',
                  'female': '&#128247; {0} сфотографировала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'фотка': {
                  'male': '&#128247; {0} сфотографировал {1}',
                  'female': '&#128247; {0} сфотографировала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'откусить': {
                  'male': '&#128556; {0} откусил {1}',
                  'female': '&#128556; {0} откусила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'купить': {
                  'male': '&#128184; {0} купил {1}',
                  'female': '&#128184; {0} купила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'продать': {
                  'male': '&#128176; {0} продал {1}',
                  'female': '&#128176; {0} продала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'опозорить': {
                  'male': '&#128520; {0} опозорил {1}',
                  'female': '&#128520; {0} опозорила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'изучить': {
                  'male': '&#128270; {0} изучил {1}',
                  'female': '&#128270; {0} изучила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'смыть': {
                  'male': '&#128701; {0} смыл {1}',
                  'female': '&#128701; {0} смыла {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'приготовить': {
                  'male': '&#129369; {0} приготовил {1}',
                  'female': '&#129369; {0} приготовила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'взорвать': {
                  'male': '&#128163;&#128165; {0} взорвал {1}',
                  'female': '&#128163;&#128165; {0} взорвала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'разбить': {
                  'male': '&#128165; {0} разбил {1}',
                  'female': '&#128165; {0} разбила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'заткнуть': {
                  'male': '&#128566; {0} заткнул {1}',
                  'female': '&#128566; {0} заткнула {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'подарить цветы': {
                  'male': '&#128144; {0} подарил цветы {1}',
                  'female': '&#128144; {0} подарила цветы {1}',
                  'case': 'dat'
            }, # дательный (dat)
            'подарить цветок': {
                  'male': '&#127800; {0} подарил цветок {1}',
                  'female': '&#127800; {0} подарила цветок {1}',
                  'case': 'dat'
            }, # дательный (dat)      
            'кинуть мячиком': {
                  'male': '&#9917; {0} кинул мячиком в {1}',
                  'female': '&#9917; {0} кинула мячиком в {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'кинуть мячик': {
                  'male': '&#9917; {0} кинул мячиком в {1}',
                  'female': '&#9917; {0} кинула мячиком в {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'бросить мячиком': {
                  'male': '&#9917; {0} бросил мячиком в {1}',
                  'female': '&#9917; {0} бросила мячиком в {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'бросить мячик': {
                  'male': '&#9917; {0} бросил мячиком в {1}',
                  'female': '&#9917; {0} бросила мячиком в {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'споки': {
                  'male': '&#128564; {0} пожелал сладких снов {1}',
                  'female': '&#128564; {0} пожелал сладких снов {1}',
                  'case': 'dat'
            }, # дательный (dat)
            'измерить': {
                  'male': '&#128207; {0} измерил {1}',
                  'female': '&#128207; {0} измерила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'замерить': {
                  'male': '&#128207; {0} замерил {1}',
                  'female': '&#128207; {0} замерила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'закрыть рот': {
                  'male': '&#129296; {0} закрыл рот {1}',
                  'female': '&#129296; {0} закрыла рот {1}',
                  'case': 'dat'
            }, # дательный (dat)
            'обслюнявить': {
                  'male': '&#129316; {0} обслюнявил {1}',
                  'female': '&#129316; {0} обслюнявила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'понюхать': {
                  'male': '&#128067; {0} понюхал {1}',
                  'female': '&#128067; {0} понюхала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'показать фак': {
                  'male': '&#128405; {0} показал фак {1}',
                  'female': '&#128405; {0} показал фак {1}',
                  'case': 'dat'
            }, # дательный (dat)
            'улыбнуться': {
                  'male': '&#128124; {0} лучезарно улыбнулся {1}',
                  'female': '&#128124; {0} лучезарно улыбнулась {1}',
                  'case': 'dat'
            }, # дательный (dat)
            'сделать массаж головы': {
                  'male': '&#128134; {0} сделал массаж головы {1}',
                  'female': '&#128134; {0} сделала массаж головы {1}',
                  'case': 'dat'
            }, # дательный (dat)
            'спеть': {
                  'male': '&#127908; {0} спел для {1}',
                  'female': '&#127908; {0} спела для {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'оглушить': {
                  'male': '&#128226; {0} оглушил {1}',
                  'female': '&#128226; {0} оглушила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'помолиться': {
                  'male': '&#9962; {0} помолился за {1}',
                  'female': '&#9962; {0} помолилась за {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'налить кофе': {
                  'male': '&#9749; {0} налил кофе {1}',
                  'female': '&#9749; {0} налила кофе {1}',
                  'case': 'dat'
            }, # дательный (dat)
            'посмотреть на звёзды': {
                  'male': '&#10024; {0} посмотрел на звёзды с {1}',
                  'female': '&#10024; {0} посмотрела на звёзды с {1}',
                  'case': 'ins'
            }, # творительный (ins)
            'сыграть в карты': {
                  'male': '&#9824; {0} сыграл в карты с {1}',
                  'female': '&#9824; {0} сыграла в карты с {1}',
                  'case': 'ins'
            }, # творительный (ins)
            'переспать': {
                  'male': '&#128719; {0} переспал с {1}',
                  'female': '&#128719; {0} переспала с {1}',
                  'case': 'ins'
            }, # творительный (ins)
            'помыть': {
                  'male': '&#128703;&#129533; {0} помыл {1}',
                  'female': '&#128703;&#129533; {0} помыла {1}',
                  'case': 'acc'
            }, # винительный (acc)       
            'подмыть': {
                  'male': '&#128703;&#129533; {0} подмыл {1}',
                  'female': '&#128703;&#129533; {0} подмыла {1}',
                  'case': 'acc'
            }, # винительный (acc)       
            'вымыть': {
                  'male': '&#128703;&#129533; {0} вымыл {1}',
                  'female': '&#128703;&#129533; {0} вымыла {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'отблагодарить': {
                  'male': '&#128591; {0} отблагодарил {1}',
                  'female': '&#128591; {0} отблагодарила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'сломать': {
                  'male': '&#128165;&#128296; {0} сломал {1}',
                  'female': '&#128165;&#128296; {0} сломала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'осмотреть': {
                  'male': '&#128064; {0} осмотрел {1}',
                  'female': '&#128064; {0} осмотрела {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'плюнуть': {
                  'male': '&#128166; {0} плюнул в {1}',
                  'female': '&#128166; {0} плюнула в {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'харкнуть': {
                  'male': '&#128166; {0} харкнул в {1}',
                  'female': '&#128166; {0} харкнул в {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'уничтожить': {
                  'male': '&#10060; {0} уничтожил {1}',
                  'female': '&#10060; {0} уничтожила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'умыть': {
                  'male': '&#128703;&#129533; {0} умыл {1}',
                  'female': '&#128703;&#129533; {0} умыла {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'облить': {
                  'male': '&#128166; {0} облил {1}',
                  'female': '&#128166; {0} облила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'полить': {
                  'male': '&#128166; {0} полил {1}',
                  'female': '&#128166; {0} полила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'закомбить': {
                  'male': '&#127947; {0} закомбил {1}',
                  'female': '&#127947; {0} закомбила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'починить': {
                  'male': '&#128295; {0} починил {1}',
                  'female': '&#128295; {0} починила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'заколоть': {
                  'male': '&#128137; {0} заколол {1}',
                  'female': '&#128137; {0} заколола {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'напоить': {
                  'male': '&#127863; {0} напоил {1}',
                  'female': '&#127863; {0} напоила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'опоить': {
                  'male': '&#127863; {0} опоил {1}',
                  'female': '&#127863; {0} опоила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'вызвать': {
                  'male': '&#128718; {0} вызвал {1}',
                  'female': '&#128718; {0} вызвала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'пометить': {
                  'male': '&#128166; {0} пометил {1}',
                  'female': '&#128166; {0} пометила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'отобрать': {
                  'male': '&#128588; {0} отобрал {1}',
                  'female': '&#128588; {0} отобрала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'позвонить': {
                  'male': '&#128241; {0} позвонил {1}',
                  'female': '&#128241; {0} позвонила {1}',
                  'case': 'dat'
            }, # дательный (dat)
            'заразить': {
                  'male': '&#129440; {0} заразил {1}',
                  'female': '&#129440; {0} заразила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'накрасить': {
                  'male': '&#128132; {0} накрасил {1}',
                  'female': '&#128132; {0} накрасила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'поиметь': {
                  'male': '&#129301; {0} поимел {1}',
                  'female': '&#129301; {0} поимела {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'воскресить': {
                  'male': '&#128123; {0} воскресил {1}',
                  'female': '&#128123; {0} воскресила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'цмок': {
                  'male': '&#128538; {0} цмокнул {1}',
                  'female': '&#128538; {0} цмокнула {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'раздеть': {
                  'male': '&#128286; {0} раздел {1}',
                  'female': '&#128286; {0} раздела {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'испепелить': {
                  'male': '&#128293; {0} испепелил {1}',
                  'female': '&#128293; {0} испепелила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'поблагодарить': {
                  'male': '&#128591; {0} поблагодарил {1}',
                  'female': '&#128591; {0} поблагодарила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'спасибо': {
                  'male': '&#128591; {0} поблагодарил {1}',
                  'female': '&#128591; {0} поблагодарила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'обмануть': {
                  'male': '&#129313; {0} обманул {1}',
                  'female': '&#129313; {0} обманула {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'чирик': {
                  'male': '&#128298; {0} чик-чирикнул {1}',
                  'female': '&#128298; {0} чик-чирикнула {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'чирикнуть': {
                  'male': '&#128298; {0} чик-чирикнул {1}',
                  'female': '&#128298; {0} чик-чирикнула {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'потрогать': {
                  'male': '&#128400; {0} потрогал {1}',
                  'female': '&#128400; {0} потрогала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'тыкнуть': {
                  'male': '&#128073; {0} тыкнул {1}',
                  'female': '&#128073; {0} тыкнула {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'тык': {
                  'male': '&#128073; {0} тыкнул {1}',
                  'female': '&#128073; {0} тыкнула {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'растерзать': {
                'male': '&#128122; {0} растерзал {1}',
                'female': '&#128122; {0} растерзала {1}',
                'case': 'acc'
            }, # винительный (acc)
            'отжарить': {
                'male': '&#127830; {0} отжарил {1}',
                'female': '&#127830; {0} отжарила {1}',
                'case': 'acc'
            }, # винительный (acc)
            'напоить': {
                'male': '&#127866; {0} напоил {1}',
                'female': '&#127866; {0} напоила {1}',
                'case': 'acc'
            }, # винительный (acc)
            'пососаться': {
                'male': '&#128139; {0} пососался с {1}',
                'female': '&#128139; {0} пососалась с {1}',
                'case': 'ins'
            }, # творительный (ins)
            'переехать': {
                'male': '&#128668; {0} переехал {1}',
                'female': '&#128668; {0} переехала {1}',
                'case': 'acc'
            }, # винительный (acc)
            'подарить': {
                'male': '&#127873; {0} подарил подарок {1}',
                'female': '&#127873; {0} подарила подарок {1}',
                'case': 'dat'
            }, # дательный (dat)
            'подарок': {
                'male': '&#127873; {0} вручил подарок {1}',
                'female': '&#127873; {0} вручила подарок {1}',
                'case': 'dat'
            }, # дательный (dat)
            'вдолбить': {
                'male': '&#128074; {0} вдолбил {1}',
                'female': '&#128074; {0} вдолбила {1}',
                'case': 'dat'
            },  # дательный (dat)
            'пробить': {
                'male': '&#129470; {0} пробил {1}',
                'female': '&#129470; {0} пробила {1}',
                'case': 'acc'
            }, # винительный (acc)
            'почистить': {
                'male': '&#129533; {0} почистил {1}',
                'female': '&#129533; {0} почистила {1}',
                'case': 'acc'
            }, # винительный (acc)
            'отмыть': {
                'male': '&#128703;&#129533; {0} отмыл {1}',
                'female': '&#128703;&#129533; {0} отмыла {1}',
                'case': 'acc'
            }, # винительный (acc)
            'сыграть': {
                'male': '&#127929; {0} сыграл на фортепиано для {1}',
                'female': '&#127929; {0} сыграла на фортепиано для {1}',
                'case': 'gen'
            }, # родительный (gen)
            'спеть': {
                'male': '&#127908; {0} спел для {1}',
                'female': '&#127908; {0} спела для {1}',
                'case': 'gen'
            }, # родительный (gen)                        
            'зарезать': {
                'male': '&#128298; {0} зарезал {1}',
                'female': '&#128298; {0} зарезала {1}',
                'case': 'acc'
            }, # винительный (acc)
            'украсть': {
                'male': '&#128717; {0} украл {1}',
                'female': '&#128717; {0} украла {1}',
                'case': 'acc'
            }, # винительный (acc)
            'удалить': {
                'male': '&#10060; {0} удалил {1}',
                'female': '&#10060; {0} удалила {1}',
                'case': 'acc'
            }, # винительный (acc)
            'ужалить': {
                'male': '&#128029; {0} ужалил {1}',
                'female': '&#128029; {0} ужалила {1}',
                'case': 'acc'
            }, # винительный (acc)
            'забрать': {
                'male': '&#128079; {0} забрал {1}',
                'female': '&#128079; {0} забрала {1}',
                'case': 'acc'
            }, # винительный (acc)
            'обглодать': {
                'male': '&#129460; {0} обглодал {1}',
                'female': '&#129460; {0} обглодала {1}',
                'case': 'acc'
            }, # винительный (acc)
            'приручить': {
                'male': '&#128022; {0} приручил {1}',
                'female': '&#128022; {0} приручила {1}',
                'case': 'acc'
            }, # винительный (acc)
            'призвать': {
                'male': '&#128276; {0} призвал {1}',
                'female': '&#128276; {0} призвала {1}',
                'case': 'acc'
            }, # винительный (acc)
            'накричать': {
                'male': '&#128227; {0} накричал на {1}',
                'female': '&#128227; {0} накричала на {1}',
                'case': 'acc'
            }, # винительный (acc)
            'приласкать': {
                'male': '&#128049; {0} приласкал {1}',
                'female': '&#128049; {0} приласкала {1}',
                'case': 'acc'
            }, # винительный (acc)
            'обидеть': {
                'male': '&#9785; {0} обидел {1}',
                'female': '&#9785; {0} обидела {1}',
                'case': 'acc'
            }, # винительный (acc)
            'приютить': {
                'male': '&#127968; {0} приютил {1}',
                'female': '&#127968; {0} приютила {1}',
                'case': 'acc'
            }, # винительный (acc)
            'путешествовать': {
                'male': '&#9992; {0} пригласил путешествовать {1}',
                'female': '&#9992; {0} пригласила путешествовать {1}',
                'case': 'acc'
            }, # винительный (acc)
            'угостить': {
                'male': '&#129473; {0} угостил {1}',
                'female': '&#129473; {0} угостила {1}',
                'case': 'acc'
            }, # винительный (acc)
            'дунуть': {
                'male': '&#127788; {0} дунул в {1}',
                'female': '&#127788; {0} дунула в {1}',
                'case': 'acc'
            }, # винительный (acc)
            'осыпать': {
                'male': '&#129344; {0} осыпал лепестками роз {1}',
                'female': '&#129344; {0} осыпала лепестками роз {1}',
                'case': 'acc'
            }, # винительный (acc)
            'наступить': {
                'male': '&#129462; {0} наступил на {1}',
                'female': '&#129462; {0} наступила на {1}',
                'case': 'acc'
            }, # винительный (acc)
            'поднять': {
                'male': '&#129330; {0} поднял {1}',
                'female': '&#129330; {0} подняла {1}',
                'case': 'acc'
            }, # винительный (acc)
            'кайфануть': {
                'male': '&#129316; {0} кайфанул с {1}',
                'female': '&#129316; {0} кайфанула с {1}',
                'case': 'ins'
            }, # творительный (ins)
            'подсмотреть': {
                'male': '&#128064; {0} подсмотрел за {1}',
                'female': '&#128064; {0} подсмотрела за {1}',
                'case': 'ins'
            }, # творительный (ins)
            'перекусить': {
                'male': '&#129361; {0} перекусил с {1}',
                'female': '&#129361; {0} перекусила с {1}',
                'case': 'ins'
            }, # творительный (ins)
            'надеть цепи': {
                'male': '&#9939; {0} надел цепи на {1}',
                'female': '&#9939; {0} надела цепи на {1}',
                'case': 'acc'
            }, # винительный (acc)
            'кинуть камень': {
                'male': '&#129704; {0} кинул камень в {1}',
                'female': '&#129704; {0} кинула камень в {1}',
                'case': 'acc'
            }, # винительный (acc)
            'бросить камень': {
                'male': '&#129704; {0} бросил камень в {1}',
                'female': '&#129704; {0} бросила камень в {1}',
                'case': 'acc'
            }, # винительный (acc)
            'стукнуть каблуком': {
                'male': '&#128096; {0} стукнул каблуком {1}',
                'female': '&#128096; {0} стукнула каблуком {1}',
                'case': 'acc'
            }, # винительный (acc)
            'ударить молнией': {
                'male': '&#9889; {0} ударил молнией в {1}',
                'female': '&#9889; {0} ударила молнией в {1}',
                'case': 'acc'
            }, # винительный (acc)
            'угостить мороженым': {
                'male': '&#127846; {0} угостил мороженым {1}',
                'female': '&#127846; {0} угостила мороженым {1}',
                'case': 'acc'
            }, # винительный (acc)
            'укрыть': {
                'male': '&#9748; {0} укрыл {1}',
                'female': '&#9748; {0} укрыла {1}',
                'case': 'acc'
            }, # винительный (acc)            
            'пойти в лес': {
                'male': '&#127794; {0} прогулялся в лесу с {1}',
                'female': '&#127794; {0} прогулялась в лесу с {1}',
                'case': 'ins'
            }, # творительный (ins)
            'сыграть в карты': {
                'male': '&#127183; {0} сыграл в карты с {1}',
                'female': '&#127183; {0} сыграла в карты с {1}',
                'case': 'ins'
            }, # творительный (ins)
            'послушать музыку': {
                'male': '&#127926; {0} послушал музыку с {1}',
                'female': '&#127926; {0} послушала музыку с {1}',
                'case': 'ins'
            }, # творительный (ins)
            'сходить в зоопарк': {
                'male': '&#128584; {0} сходил в зоопарк с {1}',
                'female': '&#128584; {0} сходила в зоопарк с {1}',
                'case': 'ins'
            }, # творительный (ins)
            'селфи': {
                'male': '&#129331; {0} сделал селфи с {1}',
                'female': '&#129331; {0} сделала селфи с {1}',
                'case': 'ins'
            }, # творительный (ins)
            'сделать селфи': {
                'male': '&#129331; {0} сделал селфи с {1}',
                'female': '&#129331; {0} сделала селфи с {1}',
                'case': 'ins'
            }, # творительный (ins)
            'танцевать': {
                'male': '&#128131; {0} потанцевал с {1}',
                'female': '&#128131; {0} потанцевала с {1}',
                'case': 'ins'
            }, # творительный (ins)
            'потанцевать': {
                'male': '&#128131; {0} потанцевал с {1}',
                'female': '&#128131; {0} потанцевала с {1}',
                'case': 'ins'
            }, # творительный (ins)
            'выбить зуб': {
                'male': '&#129463; {0} выбил зуб {1}',
                'female': '&#129463; {0} выбила зуб {1}',
                'case': 'dat'
            }, # дательный (dat)
            'леденец': {
                'male': '&#127853; {0} дал леденец {1}',
                'female': '&#127853; {0} дала леденец {1}',
                'case': 'dat'
            }, # дательный (dat)
            'дать леденец': {
                'male': '&#127853; {0} дал леденец {1}',
                'female': '&#127853; {0} дала леденец {1}',
                'case': 'dat'
            }, # дательный (dat)
            'взять леденец': {
                'male': '&#127853; {0} взял леденец у {1} ',
                'female': '&#127853; {0} взяла леденец у {1} ',
                'case': 'gen'
            }, # родительный (gen)                  
            'забулить': {
                'male': '&#128122; {0} забулил {1}',
                'female': '&#128122; {0} забулила {1}',
                'case': 'acc'
            }, # винительный (acc)
            'забуллить': {
                'male': '&#128122; {0} забуллил {1}',
                'female': '&#128122; {0} забуллила {1}',
                'case': 'acc'
            } # винительный (acc)
        }
        
        self.actions_adults = {
            'выебать': {
                  'male': '&#128073;&#128076;&#128556; {0} выебал {1}',
                  'female': '&#128073;&#128076;&#128556; {0} выебла {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'трахнуть': {
                  'male': '&#128073;&#128076;&#128556; {0} трахнул {1}',
                  'female': '&#128073;&#128076;&#128556; {0} трахнула {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'оттрахать': {
                  'male': '&#128073;&#128076;&#128556; {0} оттрахал {1}',
                  'female': '&#128073;&#128076;&#128556; {0} оттрахала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'присунуть': {
                  'male': '&#128073;&#128076;&#128556; {0} присунул {1}',
                  'female': '&#128073;&#128076;&#128556; {0} присунула {1}',
                  'case': 'dat'
            }, # дательный (dat)
            'уебать': {
                  'male': '&#128074; {0} уебал {1}',
                  'female': '&#128074; {0} уебала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'въебать': {
                  'male': '&#129308;&#128555; {0} въебал {1}',
                  'female': '&#129308;&#128555; {0} въебала {1}',
                  'case': 'dat'
            }, # дательный (dat)
            'захуярить': {
                  'male': '&#129396; {0} захуярил {1}',
                  'female': '&#129396; {0} захуярила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'хуяк': {
                  'male': '&#129396; {0} захуярил {1}',
                  'female': '&#129396; {0} захуярила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'ебануть': {
                  'male': '&#129301; {0} ебанул {1}',
                  'female': '&#129301; {0} ебанула {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'ебнуть': {
                  'male': '&#129301; {0} ебнул {1}',
                  'female': '&#129301; {0} ебнула {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'отсосать': {
                  'male': '&#127814; {0} отсосал у {1}',
                  'female': '&#127814; {0} отсосала у {1}',
                  'case': 'gen'
            }, # родительный (gen)
            'пососать': {
                  'male': '&#127814; {0} пососал у {1}',
                  'female': '&#127814; {0} пососала у {1}',
                  'case': 'gen'
            }, # родительный (gen)
            'изнасиловать': {
                  'male': '&#128558; {0} изнасиловал {1}',
                  'female': '&#128558; {0} изнасиловала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'внасиловать': {
                  'male': '&#129327; {0} внасиловал {1}',
                  'female': '&#129327; {0} внасиловала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'секс': {
                  'male': '&#128719; {0} переспал с {1}',
                  'female': '&#128719; {0} переспала с {1}',
                  'case': 'ins'
            }, # творительный (ins)
            'sex': {
                  'male': '&#128719; {0} переспал с {1}',
                  'female': '&#128719; {0} переспала с {1}',
                  'case': 'ins'
            }, # творительный (ins)
            'спиздить': {
                  'male': '&#128588;&#127939; {0} спиздил {1}',
                  'female': '&#128588;&#127939; {0} спиздила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'наебать': {
                  'male': '&#129313; {0} наебал {1}',
                  'female': '&#129313; {0} наебала {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'отлизать': {
                  'male': '&#128069; {0} отлизал {1}',
                  'female': '&#128069; {0} отлизала {1}',
                  'case': 'dat'            
            }, # дательный (dat)
            'отпиздить': {
                  'male': '&#129308;&#128565; {0} отпиздил {1}',
                  'female': '&#129308;&#128565; {0} отпиздила {1}',
                  'case': 'acc'
            }, # винительный (acc)
            'заебать': {
                'male': '&#128580; {0} заебал {1}',
                'female': '&#128580; {0} заебала {1}',
                'case': 'acc'
            }, # винительный (acc)
            'подъебать': {
                'male': '&#128514; {0} подъебал {1}',
                'female': '&#128514; {0} подъебала {1}',
                'case': 'acc'
            }, # винительный (acc)
            'заглотнуть': {
                'male': '&#127868; {0} заглотнул у {1}',
                'female': '&#127868; {0} заглотнула у {1}',
                'case': 'gen'
            } # родительный (gen)
        }        
        
        super().__init__(*(*self.actions.keys(), *self.actions_adults.keys()), prefixes=prefixes, strict=strict, required_role=required_role)
        
        
    async def process_message(self, msg):
        if not msg.is_chat or not msg.user_id:
            return await msg.answer("&#128573; Команду можно использовать только в беседе.")
        
        if "\n" in msg.full_text:
            custom_text = msg.full_text.split('\n')[0].strip()
            reply = msg.full_text.split('\n')[1].strip()
            target = await parse_user_id(msg, custom_text=custom_text)
        else:
            reply = None
            target = await parse_user_id(msg)
            
        if not target:
            keyboard = json.dumps({
                'inline': True,
                'buttons': [
                    [
                        {
                            'action': {
                                'type': 'open_link',
                                'label': '&#128166; Список ролевых игр',
                                'link': 'https://vk.com/@hypixelbot-commands?anchor=13-rolevye-igry'
                            }
                        }
                    ]
                ]
            })                            
            return await msg.answer(f"&#127856; Укажите пользователя, чтобы использовать ролевую игру.", keyboard=keyboard)
    
        command, text = self.parse_message(msg, full=True)      
        
        message_obj = self.actions.get(command, self.actions_adults.get(command))
        
        if self.actions_adults.get(command, None):
            if not msg.meta['is_supporter']:
                keyboard = json.dumps({
                    'inline': True,
                    'buttons': [
                        [
                            {
                                'action': {
                                    'type': 'open_link',
                                    'label': '&#127850; Подписка Extra',
                                    'link': 'https://vk.com/@hypixelbot-extra'
                                }
                            }
                        ]
                    ]
                })
                return await msg.answer("&#128286; Активируйте Подписку Extra, чтобы использовать ролевые игры для взрослых.", keyboard=keyboard)
        
        username = await get_username(msg)        
        sex = None
        sex = await get_user_sex(msg.from_id, msg)
        if not sex:
            sex = 0
        
        name_case = message_obj['case'] if 'case' in message_obj else 'acc'
        target_username = await get_username(msg, target, name_case=name_case)

        message = message_obj["female"] if sex == 1 else message_obj["male"]

        message = message.format(username, target_username) + "."
        
        if reply:
            if not msg.meta['is_supporter']:
                keyboard = json.dumps({
                    'inline': True,
                    'buttons': [
                        [
                            {
                                'action': {
                                    'type': 'open_link',
                                    'label': '&#127850; Подписка Extra',
                                    'link': 'https://vk.com/@hypixelbot-extra'
                                }
                            }
                        ]
                    ]
                })
                return await msg.answer("&#129392; Активируйте Подписку Extra, чтобы использовать реплики к ролевым играм.", keyboard=keyboard)
            if reply: message += f"\n&#128172; С репликой: «{reply}»"
        
        return await msg.answer(message, disable_mentions=1)